tap "felixkratz/formulae"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "probe-rs/probe-rs"
brew "automake"
brew "clang-format"
brew "cmake"
brew "fastfetch"
brew "gh"
brew "git"
brew "libtool"
brew "graphviz"
brew "htop"
brew "libusb"
brew "z3"
brew "llvm"
brew "mas"
brew "ninja"
brew "node@20"
brew "open-ocd"
brew "rust"
brew "starship"
brew "stlink"
brew "tesseract"
brew "translate-shell"
brew "tree"
brew "uv"
brew "vim"
brew "felixkratz/formulae/borders"
brew "probe-rs/probe-rs/probe-rs"
cask "nikitabobko/tap/aerospace"
cask "betterdisplay"
cask "clash-verge-rev"
cask "copilot-cli"
cask "easydict"
cask "folo"
cask "font-maple-mono-nf-cn"
cask "google-drive"
cask "homerow"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "localsend"
cask "microsoft-edge"
cask "miniconda"
cask "moonlight"
cask "mos"
cask "neteasemusic"
cask "nomachine"
cask "obs"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "scroll-reverser"
cask "squirrel-app"
cask "tailscale-app"
mas "Bitwarden", id: 1352778147
mas "Developer", id: 640199958
mas "iMovie 剪辑", id: 408981434
mas "Keynote讲演", id: 409183694
mas "Numbers表格", id: 409203825
mas "Pages文稿", id: 409201541
mas "Xcode", id: 497799835
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "腾讯会议", id: 1484048379
mas "鼠须管绘板", id: 1530616498
vscode "adpyke.codesnap"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "johnpapa.vscode-peacock"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "natqe.reload"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "zhuangtongfa.material-theme"
